nc: 3
names: ['tank', 'soldier', 'mvehicle','cvehicle']

depth_multiple: 0.33
width_multiple: 0.33

anchors: 3

backbone:
 [
   [-1,1,Conv,[16,3,2]],
   [-1,1,C2f,[16,True]],

   [-1,1,Conv,[32,3,2]],
   [-1,1,C2f,[32,True]],
   
   [-1,1,Conv,[64,3,2]],
   [-1,2,C2f,[64,True]],

   [-1,1,SPPF,[64]]
 ]    

 head:
 [
   [-1,1,Conv,[32,1,1]],
   [-1,1,nn.Upsample,[None,2,'nearest']],
   [[-1,3],1,Concat,[1]],
   [-1,1,C2f,[32]],

   [-1,1,Conv,[32,3,2]],
   [[-1,5],1,Concat,[1]],
   [-1,1,C2f,[64]],

   [[9,12],1,Detect,[nc]]
 ]