# Custom YOLOv8n for 3 classes: Soldier, Tank, Car

depth_multiple: 0.33
width_multiple: 0.25

anchors: 3

backbone:
  [
    [-1, 1, Conv, [64, 3, 2]],
    [-1, 1, Conv, [128, 3, 2]],
    [-1, 3, C2f, [128, True]],
    [-1, 1, Conv, [256, 3, 2]],
    [-1, 3, C2f, [256, True]],
    [-1, 1, Conv, [512, 3, 2]],
    [-1, 1, C2f, [512, True]],
    [-1, 1, SPPF, [512]]
  ]

head:
  [
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],
    [-1, 3, C2f, [256]],

    [-1, 1, Conv, [128, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 2], 1, Concat, [1]],
    [-1, 3, C2f, [128]],

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 12], 1, Concat, [1]],
    [-1, 3, C2f, [256]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 8], 1, Concat, [1]],
    [-1, 3, C2f, [512]],

    [[15, 18, 21], 1, Detect, [3]]
  ]
