# Model configuration for YOLOv8-based lightweight architecture

nc: 3  # number of classes (örnek: tank, soldier, vehicle)
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119] # P4/16
  - [116,90, 156,198, 373,326] # P5/32

backbone:
  [
    [-1, 1, Conv, [64, 3, 1]],
    [-1, 1, C2f, [128, True]],
    [-1, 3, C2f, [256, True]],
    [-1, 3, C2f, [512, True]],
    [-1, 1, SPPF, [512]]
  ]

head:
  [
    [-1, 1, Conv, [256, 1, 1]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 2], 1, Concat, [1]],
    [-1, 3, C2f, [256]],
    [-1, 1, Conv, [128, 1, 1]],
    [-1, 1, Detect, [nc]]
  ]
